#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.vpc_backend.data.aws_availability_zones.available: Reading...
module.vpc_gateway.data.aws_availability_zones.available: Reading...
module.vpc_peering.data.aws_eks_cluster_auth.gateway[0]: Reading...
data.aws_caller_identity.current: Reading...
module.vpc_peering.data.aws_eks_cluster.gateway[0]: Reading...
module.vpc_gateway.aws_vpc.main: Refreshing state... [id=vpc-09b034b9bb716ae48]
module.eks_backend.aws_iam_role.node_group[0]: Refreshing state... [id=eks-backend-eks-node-role]
module.eks_gateway.aws_iam_role.node_group[0]: Refreshing state... [id=eks-gateway-eks-node-role]
module.vpc_peering.data.aws_eks_cluster_auth.gateway[0]: Read complete after 0s [id=gateway]
module.eks_backend.aws_iam_role.cluster[0]: Refreshing state... [id=eks-backend-eks-cluster-role]
module.eks_gateway.aws_iam_role.cluster[0]: Refreshing state... [id=eks-gateway-eks-cluster-role]
module.vpc_backend.aws_vpc.main: Refreshing state... [id=vpc-0704bfac28c9294c7]
data.aws_caller_identity.current: Read complete after 0s [id=721500739616]
module.eks_gateway.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceController[0]: Refreshing state... [id=eks-gateway-eks-cluster-role-20251021180258159800000001]
module.eks_gateway.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Refreshing state... [id=eks-gateway-eks-cluster-role-20251021180258254100000002]
module.vpc_gateway.data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
module.vpc_backend.data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
module.eks_backend.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Refreshing state... [id=eks-backend-eks-cluster-role-20251021183031521700000009]
module.eks_backend.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceController[0]: Refreshing state... [id=eks-backend-eks-cluster-role-20251021183031488800000003]
module.eks_gateway.aws_iam_role_policy_attachment.node_group_AmazonEKS_CNI_Policy[0]: Refreshing state... [id=eks-gateway-eks-node-role-20251021183031513600000006]
module.eks_gateway.aws_iam_role_policy_attachment.node_group_AmazonEKSWorkerNodePolicy[0]: Refreshing state... [id=eks-gateway-eks-node-role-20251021183031509000000005]
module.eks_gateway.aws_iam_role_policy_attachment.node_group_AmazonEC2ContainerRegistryReadOnly[0]: Refreshing state... [id=eks-gateway-eks-node-role-20251021183031517000000008]
module.eks_gateway.aws_iam_role_policy.node_group_load_balancer[0]: Refreshing state... [id=eks-gateway-eks-node-role:eks-gateway-node-loadbalancer-policy]
module.eks_backend.aws_iam_role_policy_attachment.node_group_AmazonEC2ContainerRegistryReadOnly[0]: Refreshing state... [id=eks-backend-eks-node-role-2025102118303152310000000a]
module.eks_backend.aws_iam_role_policy.node_group_load_balancer[0]: Refreshing state... [id=eks-backend-eks-node-role:eks-backend-node-loadbalancer-policy]
module.eks_backend.aws_iam_role_policy_attachment.node_group_AmazonEKS_CNI_Policy[0]: Refreshing state... [id=eks-backend-eks-node-role-20251021183031513700000007]
module.eks_backend.aws_iam_role_policy_attachment.node_group_AmazonEKSWorkerNodePolicy[0]: Refreshing state... [id=eks-backend-eks-node-role-20251021183031505200000004]
module.vpc_peering.data.aws_eks_cluster.gateway[0]: Read complete after 0s [id=gateway]
module.vpc_backend.aws_route_table.private[0]: Refreshing state... [id=rtb-074459c5a8868ca46]
module.vpc_backend.aws_route_table.public: Refreshing state... [id=rtb-061af53daf32655ed]
module.vpc_backend.aws_subnet.public[0]: Refreshing state... [id=subnet-0a1710672f6f31f00]
module.vpc_backend.aws_route_table.private[1]: Refreshing state... [id=rtb-0f7141330b45dd52d]
module.vpc_backend.aws_subnet.private[1]: Refreshing state... [id=subnet-0a9c7c4a4e9c56f26]
module.vpc_backend.aws_subnet.public[1]: Refreshing state... [id=subnet-000f27c7eb45eba2e]
module.vpc_backend.aws_internet_gateway.main: Refreshing state... [id=igw-0f4d68189c379170b]
module.vpc_backend.aws_subnet.private[0]: Refreshing state... [id=subnet-035c79fdb38084ef0]
module.eks_backend.aws_security_group.cluster: Refreshing state... [id=sg-0a706387ded4d5f09]
module.vpc_gateway.aws_internet_gateway.main: Refreshing state... [id=igw-019af2349c77b63e7]
module.vpc_gateway.aws_route_table.public: Refreshing state... [id=rtb-094bdc2824dd38513]
module.vpc_gateway.aws_route_table.private[0]: Refreshing state... [id=rtb-01d5a76f094367d98]
module.vpc_gateway.aws_route_table.private[1]: Refreshing state... [id=rtb-0bdebb044fd241e60]
module.vpc_gateway.aws_subnet.public[0]: Refreshing state... [id=subnet-0e99b85d6fe823c70]
module.vpc_gateway.aws_subnet.public[1]: Refreshing state... [id=subnet-0e4e5d06536cf0b93]
module.vpc_gateway.aws_subnet.private[0]: Refreshing state... [id=subnet-0f6bdbe631ddd4533]
module.vpc_gateway.aws_subnet.private[1]: Refreshing state... [id=subnet-0420903a428f2d45b]
module.vpc_backend.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0a6af223178c7f59d]
module.vpc_backend.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-024eb02e17fa393cd]
module.vpc_backend.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0e3e33852d656f1a0]
module.vpc_backend.aws_eip.nat[0]: Refreshing state... [id=eipalloc-082e751678beb3ad5]
module.vpc_gateway.aws_eip.nat[0]: Refreshing state... [id=eipalloc-08cb8cc0884389910]
module.vpc_gateway.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0fd0798beaec01be0]
module.vpc_peering.aws_vpc_peering_connection.main: Refreshing state... [id=pcx-095e2f9f6494f1db1]
module.eks_gateway.aws_security_group.cluster: Refreshing state... [id=sg-0de1de05095ba598f]
module.vpc_backend.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0ce0bee9666675156]
module.vpc_backend.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0366db989e1106497]
module.eks_backend.aws_eks_cluster.main: Refreshing state... [id=backend]
module.vpc_gateway.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0de5cbe96a74d0eb5]
module.vpc_gateway.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0f71b545e07752efe]
module.vpc_gateway.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01ee6961b578b3594]
module.vpc_gateway.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0003acd6846a8c577]
module.vpc_peering.aws_route.peer_to_vpc[0]: Refreshing state... [id=r-rtb-074459c5a8868ca46179966490]
module.vpc_peering.aws_route.peer_to_vpc[1]: Refreshing state... [id=r-rtb-0f7141330b45dd52d179966490]
module.vpc_peering.kubernetes_config_map_v1_data.coredns_custom[0]: Refreshing state... [id=kube-system/coredns]
module.vpc_peering.aws_route.vpc_to_peer[0]: Refreshing state... [id=r-rtb-01d5a76f094367d983322942084]
module.vpc_peering.aws_route.vpc_to_peer[1]: Refreshing state... [id=r-rtb-0bdebb044fd241e603322942084]
module.eks_gateway.aws_eks_cluster.main: Refreshing state... [id=gateway]
module.vpc_backend.aws_nat_gateway.main[1]: Refreshing state... [id=nat-0e4cbe89bd897d123]
module.vpc_backend.aws_nat_gateway.main[0]: Refreshing state... [id=nat-055b4c11bd25941bd]
module.vpc_gateway.aws_nat_gateway.main[0]: Refreshing state... [id=nat-09d6c52b591442318]
module.vpc_gateway.aws_nat_gateway.main[1]: Refreshing state... [id=nat-0e641392243d19a9b]
module.eks_backend.aws_eks_node_group.main: Refreshing state... [id=backend:backend-node-group]
module.eks_security.aws_security_group_rule.backend_allow_gateway: Refreshing state... [id=sgrule-3232139918]
module.eks_security.aws_security_group_rule.gateway_allow_backend: Refreshing state... [id=sgrule-2437306521]
module.eks_gateway.aws_eks_node_group.main: Refreshing state... [id=gateway:gateway-node-group]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.vpc_backend.aws_route.private_nat[0] will be created
  + resource "aws_route" "private_nat" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = "nat-055b4c11bd25941bd"
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-074459c5a8868ca46"
      + state                  = (known after apply)
    }

  # module.vpc_backend.aws_route.private_nat[1] will be created
  + resource "aws_route" "private_nat" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = "nat-0e4cbe89bd897d123"
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-0f7141330b45dd52d"
      + state                  = (known after apply)
    }

  # module.vpc_backend.aws_route.public_internet will be created
  + resource "aws_route" "public_internet" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = "igw-0f4d68189c379170b"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-061af53daf32655ed"
      + state                  = (known after apply)
    }

  # module.vpc_gateway.aws_route.private_nat[0] will be created
  + resource "aws_route" "private_nat" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = "nat-09d6c52b591442318"
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-01d5a76f094367d98"
      + state                  = (known after apply)
    }

  # module.vpc_gateway.aws_route.private_nat[1] will be created
  + resource "aws_route" "private_nat" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = "nat-0e641392243d19a9b"
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-0bdebb044fd241e60"
      + state                  = (known after apply)
    }

  # module.vpc_gateway.aws_route.public_internet will be created
  + resource "aws_route" "public_internet" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = "igw-019af2349c77b63e7"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-094bdc2824dd38513"
      + state                  = (known after apply)
    }

  # module.vpc_peering.kubernetes_config_map_v1_data.coredns_custom[0] will be updated in-place
  ~ resource "kubernetes_config_map_v1_data" "coredns_custom" {
      ~ data          = {
          ~ "Corefile" = <<-EOT
                .:53 {
                    errors
                    health {
                        lameduck 5s
                    }
                    ready
                    kubernetes cluster.local in-addr.arpa ip6.arpa {
                        pods insecure
                        fallthrough in-addr.arpa ip6.arpa
                        ttl 30
                    }
                    prometheus :9153
                    forward . /etc/resolv.conf {
                        max_concurrent 1000
                    }
                    cache 30
                    loop
                    reload
                    loadbalance
                }
                
                # Stub domain for backend cluster DNS resolution
                backend.default.svc.cluster.local:53 {
                    errors
                    cache 30
              -     forward . 172.20.0.10
              +     forward . 10.1.0.2
                }
            EOT
        }
        id            = "kube-system/coredns"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 6 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @rapydevops-gh, Action: `pull_request`, Workflow: `Terraform Infrastructure`*